# ContinuousRailGometryCreationFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailGometryCreationFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot create the continuous rail geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailGometryCreationFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailGometryCreationFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailGometryCreationFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace